# OECD Linear Regressiob

## Daten für die Hausarbeit
- OECD
Regression Model OLS
Model:
    BIP = Oil_price + (m1,m2,m3) + CPI + evtl Arbeitslosigkeit

In [13]:
import pandas as pd
import datetime as dt

In [19]:
df_m1 = pd.read_csv('/Users/riccardo/Desktop/Repositorys_Github/Training/Scripts/models/Linear Regression/Data_EU/ECB Data Portal_20240412210249.csv')
df_m2 = pd.read_csv('/Users/riccardo/Desktop/Repositorys_Github/Training/Scripts/models/Linear Regression/Data_EU/ECB Data Portal_20240412210913.csv')
df_m3 = pd.read_csv('/Users/riccardo/Desktop/Repositorys_Github/Training/Scripts/models/Linear Regression/Data_EU/ECB Data Portal_20240412210918.csv')

In [21]:
df_m1.rename(columns={'Monetary aggregate M1 reported by MFIs, central gov. and post office giro institutions in the euro area (stocks) (BSI.M.U2.Y.V.M10.X.1.U2.2300.Z01.E)': 'M1'}, inplace=True)
df_m2.rename(columns={'Monetary aggregate M2 reported by MFIs, central gov. and post office giro institutions in the euro area (stocks) (BSI.M.U2.Y.V.M20.X.1.U2.2300.Z01.E)': 'M2'}, inplace=True)
df_m3.rename(columns={'Monetary aggregate M3 reported by MFIs, central gov. and post office giro institutions in the euro area (stocks) (BSI.M.U2.Y.V.M30.X.1.U2.2300.Z01.E)': 'M3'}, inplace=True)

df_m1.drop(columns=['TIME PERIOD'], inplace=True)
df_m2.drop(columns=['TIME PERIOD'], inplace=True)
df_m3.drop(columns=['TIME PERIOD'], inplace=True)

#df_m1.drop(columns=['TIME PERIOD'], inplace=True)

In [26]:
df_m1.head()

         DATE      M1
0  1980-01-31  444330
1  1980-02-29  447116
2  1980-03-31  451370
3  1980-04-30  453226
4  1980-05-31  455917

In [29]:
df_merged = df_m1.merge(df_m2, on='DATE')
df_merged = df_merged.merge(df_m3, on='DATE')

In [30]:
df_merged

           DATE        M1        M2        M3
0    1980-01-31    444330   1070496   1097404
1    1980-02-29    447116   1078232   1105520
2    1980-03-31    451370   1088333   1117228
3    1980-04-30    453226   1093263   1122639
4    1980-05-31    455917   1100958   1130672
..          ...       ...       ...       ...
525  2023-10-31  10405119  15028039  15971259
526  2023-11-30  10369147  15048687  16002988
527  2023-12-31  10370863  15139155  16137064
528  2024-01-31  10262384  15070844  16090898
529  2024-02-29  10248551  15105923  16118106

[530 rows x 4 columns]